var foo = 1; //ініціалізація числа 1 який записан змінну foo
function bar() {  //ініціалізація функції яка має назву bar
    // var foo; 
    if (!foo) {      // виходить так що параметр foo виходить false а параметр ! інвертує його на true. А до цього ми ініцаілізуем foo у функції завдяки підняттю

        var foo = 10; //ми присвоюємо йому число 10
    } 
    alert(foo); //вивід foo а вона вже містить число 10
} 
bar(); //запуск функції при відкритті сторінки html
 


//вивелось число 10 так як миe функції підіймаємо код і всередені проголошуємо var foo; це виходить false але параметр ! перетворює на true і активується if де при присвоюємо foo 10 і потім виводимо

var a = 1;   // присвоюємо значення а=1
function b() {   
    // var a;    // через підняття ми фактично ініціалізуєм тут var a;
    a = 10; //потім фактично var a = 10;
    return;  // ми повертаємо значення 10 у функцію b 
    
} 
b(); //визиваємо функцію b
console.log(a); // виводимо значення функції а
